In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays ORDER BY song_id LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(483, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 22, 0, 12, 6, 796000), 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 22, 0, 15, 41, 796000), 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (1, datetime.datetime(2018, 11, 22, 0, 9, 10, 796000), 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 22, 0, 23, 40, 796000), 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(15, 'Lily', 'Koch', 'F', 'paid'),
 (15, 'Lily', 'Koch', 'F', 'paid'),
 (15, 'Lily', 'Koch', 'F', 'paid'),
 (15, 'Lily', 'Koch', 'F', 'paid'),
 (15, 'Lily', 'Koch', 'F', 'paid')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMJBYD12A6D4F8557', 'Keepin It Real (Skit)', 'ARD0S291187B9B7BF5', 0, 114.78159),
 ('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, 218.77506),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, 266.39628),
 ('SOYMRWW12A6D4FAB14', 'The Moon And I (Ordinary Day Album Version)', 'ARKFYS91187B98E58F', 0, 267.7024)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD0S291187B9B7BF5', 'Rated R', 'Ohio', 'NaN', 'NaN'),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', '35.219619999999999', '-80.019549999999995'),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', 'NaN', 'NaN'),
 ('ARNTLGG11E2835DDB9', 'Clp', '', 'NaN', 'NaN'),
 ('ARKFYS91187B98E58F', 'Jeff And Sheri Easter', '', 'NaN', 'NaN')]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.time(0, 3, 52, 796000), 0, 22, 47, 11, 2018, 3),
 (datetime.time(0, 9, 10, 796000), 0, 22, 47, 11, 2018, 3),
 (datetime.time(0, 12, 6, 796000), 0, 22, 47, 11, 2018, 3),
 (datetime.time(0, 15, 41, 796000), 0, 22, 47, 11, 2018, 3),
 (datetime.time(0, 23, 40, 796000), 0, 22, 47, 11, 2018, 3)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [15]:
import psycopg2

conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
cur = conn.cursor()

cur.execute("SELECT s.song_id, a.artist_id FROM songs s \
JOIN artists a ON s.artist_id=a.artist_id \
WHERE s.title = %s AND a.name = %s AND ROUND(s.duration) = ROUND(%s)", 
('Keepin It Real (Skit)', 'Rated R', 114.7815));
#('La Vie En Rose', 'Dee Dee Bridgewater', 318.64118));
result = cur.fetchone()

print(result)

('SOMJBYD12A6D4F8557', 'ARD0S291187B9B7BF5')

In [13]:
%sql SELECT * FROM songs WHERE song_id = 'SOZCTXZ12AB0182364';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOZCTXZ12AB0182364', 'Setanta matins', 'AR5KOSW1187FB35FF4', 0, 269.58322)]

In [12]:
%sql SELECT * FROM artists WHERE artist_id = 'AR5KOSW1187FB35FF4';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR5KOSW1187FB35FF4', 'Elena', 'Dubai UAE', '49.803879999999999', '15.474909999999999')]